Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/enterprise-security/source/abstraction/tls/COMPONENT_MBEDTLS/cy_tls_abstraction.c
/*
 * Copyright 2024, Cypress Semiconductor Corporation (an Infineon company) or
 * an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
 *
 * This software, including source code, documentation and related
 * materials ("Software") is owned by Cypress Semiconductor Corporation
 * or one of its affiliates ("Cypress") and is protected by and subject to
 * worldwide patent protection (United States and foreign),
 * United States copyright laws and international treaty provisions.
 * Therefore, you may use this Software only as provided in the license
 * agreement accompanying the software package from which you
 * obtained this Software ("EULA").
 * If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
 * non-transferable license to copy, modify, and compile the Software
 * source code solely for use in connection with Cypress's
 * integrated circuit products.  Any reproduction, modification, translation,
 * compilation, or representation of this Software except as specified
 * above is prohibited without the express written permission of Cypress.
 *
 * Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
 * reserves the right to make changes to the Software without notice. Cypress
 * does not assume any liability arising out of the application or use of the
 * Software or any product or circuit described in the Software. Cypress does
 * not authorize its products for use in any products where a malfunction or
 * failure of the Cypress product may reasonably be expected to result in
 * significant property damage, injury or death ("High Risk Product"). By
 * including Cypress's product in a High Risk Product, the manufacturer
 * of such system or application assumes all risk of such use and in doing
 * so agrees to indemnify Cypress against all liability.
 */

#include "cy_enterprise_security_log.h"
#include "cy_tls_abstraction.h"
#include "cy_supplicant_structures.h"
#include "cy_supplicant_process_et.h"

/******************************************************
 *                      Macros
 ******************************************************/

#if defined ( MBEDTLS_SSL_PROTO_TLS1 )
#define MIN_TLS_VERSION MBEDTLS_SSL_MINOR_VERSION_1
#elif defined ( MBEDTLS_SSL_PROTO_TLS1_1 )
#define MIN_TLS_VERSION MBEDTLS_SSL_MINOR_VERSION_2
#else
#define MIN_TLS_VERSION MBEDTLS_SSL_MINOR_VERSION_3
#endif

#if defined( MBEDTLS_SSL_PROTO_TLS1_2 )
#define MAX_TLS_VERSION MBEDTLS_SSL_MINOR_VERSION_3
#elif defined (MBEDTLS_SSL_PROTO_TLS1_1)
#define MAX_TLS_VERSION MBEDTLS_SSL_MINOR_VERSION_2
#else
#define MAX_TLS_VERSION MBEDTLS_SSL_MINOR_VERSION_1
#endif
/******************************************************
 *                    Function prototypes
 ******************************************************/
#ifdef ENABLE_TLS_WRAPPER_DUMP
static void tls_dump_bytes ( const uint8_t* bptr, uint32_t len );
#else
#define tls_dump_bytes( bptr, len )
#endif

extern tls_agent_packet_t* supplicant_receive_eap_tls_packet( void* workspace_in, uint32_t* length, uint32_t timeout );

struct options
{
    int         min_version;   /* minimum protocol version accepted */
    int         max_version;   /* maximum protocol version accepted */
    int         auth_mode;     /* verify mode for connection        */
    const char  *curves;       /* list of supported elliptic curves */
    const char  *alpn_string;  /* ALPN supported protocols          */
    int         transport;     /* TLS or DTLS?                      */
} opt;

#if defined(MBEDTLS_SSL_EXPORT_KEYS)
#if (MBEDTLS_VERSION_NUMBER >= MBEDTLS_VERSION_WITH_PRF_SUPPORT)
static int eap_tls_key_derivation( void *p_expkey, const unsigned char *ms, const unsigned char *kb, size_t maclen, size_t keylen, size_t ivlen, const unsigned char client_random[32], const unsigned char server_random[32], mbedtls_tls_prf_types tls_prf_type )
{
    cy_tls_context_t* tls_context = p_expkey;
    eap_tls_keys *keys = (eap_tls_keys *)&tls_context->eap_tls_keying;
    ( ( void ) kb );
    ( ( void ) maclen );
    ( ( void ) keylen );
    ( ( void ) ivlen );
    memcpy( keys->master_secret, ms, sizeof( keys->master_secret ) );
    memcpy( keys->randbytes, client_random, 32 );
    memcpy( keys->randbytes + 32, server_random, 32 );
    keys->tls_prf_type = tls_prf_type;
    tls_context->resume = tls_context->context.handshake->resume;
    return( 0 );
}
#else
static int eap_tls_key_derivation( void *p_expkey, const unsigned char *ms, const unsigned char *kb, size_t maclen, size_t keylen,  size_t ivlen )
{
    cy_tls_context_t* tls_context = p_expkey;
    eap_tls_keys *keys = (eap_tls_keys *)&tls_context->eap_tls_keying;
    ( ( void ) kb );
    ( ( void ) maclen );
    ( ( void ) keylen );
    ( ( void ) ivlen );
/* random bytes are collected in eap_ssl_receive_packet function */

    memcpy( keys->master_secret, ms, sizeof( keys->master_secret ) );
    tls_context->resume = tls_context->context.handshake->resume;
    keys->supplicant_tls_prf = tls_context->context.handshake->tls_prf;
    return( 0 );
}
#endif /* MBEDTLS_VERSION_NUMBER >= MBEDTLS_VERSION_WITH_PRF_SUPPORT */
#endif /* MBEDTLS_SSL_EXPORT_KEYS */

#ifdef ENABLE_TLS_WRAPPER_DUMP
static void tls_dump_bytes( const uint8_t* bptr, uint32_t len )
{
    uint32_t i = 0;

    for( i = 0; i < len; )
    {
        if( ( i & 0x0f ) == 0 )
        {
            CY_SUPPLICANT_TLS_DUMP_BYTES( ( "\n" ) );
        }
        else if( ( i & 0x07 ) == 0 )
        {
            CY_SUPPLICANT_TLS_DUMP_BYTES( (" ") );
        }
        CY_SUPPLICANT_TLS_DUMP_BYTES( ( "%02x ", bptr[i++] ) );
    }
    CY_SUPPLICANT_TLS_DUMP_BYTES( ( "\n" ) );
}
#endif /*ENABLE_TLS_WRAPPER_DUMP*/

#if defined(MBEDTLS_DEBUG_C)
static void mbedtls_debug( void *ctx, int level, const char *file, int line, const char *str )
{
    ( (void) level );
    TLS_WRAPPER_DEBUG(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s:%04d: %s", file, line, str);
}
#endif /* MBEDTLS_DEBUG_C */

int eap_ssl_receive_packet( void *ctx, unsigned char *buf, size_t len )
{
    supplicant_workspace_t* workspace = (supplicant_workspace_t*) ctx;
    uint16_t temp_length = 0;
    uint16_t temp_available_length = 0;
    uint8_t* data = NULL;
    unsigned char *temp_buf = buf;
    tls_agent_packet_t* packet = NULL;
    int requested_bytes = len;
    uint32_t length = 0;

    while( requested_bytes > 0 )
    {
        if( workspace->tls_context->remaining_bytes > 0)
        {
            int x = workspace->tls_context->remaining_bytes;
            memcpy( temp_buf, workspace->tls_context->buffer_to_use, SUPPLICANT_DEFS_MIN( x, requested_bytes ) );
            temp_buf = temp_buf + SUPPLICANT_DEFS_MIN( x, requested_bytes );
            workspace->tls_context->buffer_to_use = workspace->tls_context->buffer_to_use + SUPPLICANT_DEFS_MIN( x, requested_bytes );
            workspace->tls_context->remaining_bytes = workspace->tls_context->remaining_bytes - SUPPLICANT_DEFS_MIN( x, requested_bytes );
            workspace->tls_context->bytes_consumed =  workspace->tls_context->bytes_consumed +  SUPPLICANT_DEFS_MIN( x, requested_bytes );
            requested_bytes = requested_bytes -  SUPPLICANT_DEFS_MIN( x, requested_bytes );

