Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/enterprise-security/source/abstraction/tls/COMPONENT_MBEDTLS/cy_tls_abstraction.c
        }
        else
        {
            packet = supplicant_receive_eap_tls_packet( workspace, &length, SUPPLICANT_TIMEOUT );
            if(packet == NULL)
            {
                TLS_WRAPPER_DEBUG(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "error eap_ssl_receive_packet : MBEDTLS_ERR_SSL_TIMEOUT \n");
                return CY_RSLT_ENTERPRISE_SECURITY_TIMEOUT;
            }

            supplicant_host_get_tls_data( workspace, (supplicant_packet_t) packet, 0 , &data, &temp_length, &temp_available_length );
            workspace->tls_context->buffer_to_use = workspace->tls_context->buffered_data;
            memcpy( workspace->tls_context->buffer_to_use, data, length );
            workspace->tls_context->bytes_consumed = 0;
            workspace->tls_context->remaining_bytes = length;
            workspace->tls_context->total_bytes = length;

            supplicant_host_free_packet( workspace->interface->whd_driver,packet );
        }
    }

#if !(MBEDTLS_VERSION_NUMBER >= MBEDTLS_VERSION_WITH_PRF_SUPPORT)
    /* Fetch random bytes for mppe key generation */
    if( workspace->tls_context->context.state == MBEDTLS_SSL_SERVER_HELLO )
    {
        size_t ssl_hs_hdr_len = mbedtls_ssl_hs_hdr_len( &workspace->tls_context->context );
        /* The packet length should be greater than (SSL_HS_HEADER_LEN + TLS_SERVER_VERSION_LEN + SERVER_RANDBYTE_LEN ) */
        if( len >= ssl_hs_hdr_len + TLS_SERVER_VERSION_LEN + TLS_SERVER_RANDOM_BYTES )
        {
            temp_buf = buf;
            temp_buf += mbedtls_ssl_hs_hdr_len( &workspace->tls_context->context );
            /* copy client random bytes */
            memcpy( workspace->tls_context->eap_tls_keying.randbytes, workspace->tls_context->context.handshake->randbytes, TLS_CLIENT_RANDOM_BYTES );
            /* copy server random bytes */
            memcpy( workspace->tls_context->eap_tls_keying.randbytes + TLS_CLIENT_RANDOM_BYTES, temp_buf + TLS_SERVER_VERSION_LEN, TLS_SERVER_RANDOM_BYTES );
        }
        else
        {
            TLS_WRAPPER_DEBUG(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Packet length is too short, cannot fetch server random bytes\n");
        }
    }
#endif /* !(MBEDTLS_VERSION_NUMBER >= MBEDTLS_VERSION_WITH_PRF_SUPPORT) */

    return ((int) len);
}

static cy_rslt_t supplicant_host_send_eap_tls_fragments( supplicant_workspace_t* workspace, uint8_t* buffer, uint16_t length )
{
    //CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, "TLS handshake state: %u\r\n", (unsigned int) workspace->tls_context->context.state);

    /* Send the alert message to peer */
    if(workspace->tls_context->context.out_msgtype == MBEDTLS_SSL_MSG_ALERT)
    {
        memset( workspace->buffer, 0, workspace->buffer_size );

        /* Point the buffer pointer at the start of the buffer */
        workspace->data_start   = workspace->buffer;

        memcpy(workspace->data_start, buffer, length);

        /* Point data at the start of the buffer */
        workspace->data_end = workspace->data_start + length;
    }
    else
    {
        if ( ( workspace->tls_context->context.state == MBEDTLS_SSL_SERVER_HELLO) ||
                ( ( workspace->have_packet == 0 ) && ( workspace->tls_context->context.state == MBEDTLS_SSL_CLIENT_CERTIFICATE ) ) ||
                ( ( workspace->have_packet == 0 ) && ( workspace->tls_context->context.state == MBEDTLS_SSL_CERTIFICATE_VERIFY ) ) ||
                ( ( workspace->have_packet == 0 ) && ( workspace->tls_context->context.state == MBEDTLS_SSL_CLIENT_KEY_EXCHANGE ) ) ||
                ( ( workspace->tls_context->context.state == MBEDTLS_SSL_CLIENT_FINISHED ) &&  ( workspace->tls_context->resume == 1 ) ) ) /* Session resumption case */
        {

            /* Mark that we already started a record, so that a
             * Certificate verify won't create it's own if the certificate is already sent.
             */
            workspace->have_packet = 1;
            memset( workspace->buffer, 0, workspace->buffer_size );

            /* Point the buffer pointer at the start of the buffer */

            workspace->data_start   = workspace->buffer;

            memcpy(workspace->data_start, buffer, length);

            /* Point data at the start of the buffer */
            workspace->data_end = workspace->data_start + length;

            /* If this is the client certificate exchange or change cipher spec with session resumption then return so the TLS engine provides the rest of the handshake packets */
            if ( ( ( workspace->tls_context->context.state == MBEDTLS_SSL_CLIENT_CERTIFICATE ) ) ||
                    ( ( workspace->tls_context->context.state == MBEDTLS_SSL_CERTIFICATE_VERIFY ) ) ||
                    ( ( workspace->tls_context->context.state == MBEDTLS_SSL_CLIENT_KEY_EXCHANGE ) ) ||
                    ( ( workspace->tls_context->context.state == MBEDTLS_SSL_CLIENT_FINISHED ) && ( workspace->tls_context->resume == 1 ) ) )
            {
                return CY_RSLT_SUCCESS;
            }

        }
        else if ( ( workspace->tls_context->context.state > MBEDTLS_SSL_CLIENT_CERTIFICATE )  &&  ( workspace->tls_context->context.state < MBEDTLS_SSL_SERVER_CHANGE_CIPHER_SPEC ) )
        {
            /* Append the handshake message and return for more unless it's the last message */
            memcpy(workspace->data_end, buffer, length);
            workspace->data_end += length;
            return CY_RSLT_SUCCESS;
        }
        else if ( ( workspace->tls_context->context.state == MBEDTLS_SSL_SERVER_CHANGE_CIPHER_SPEC ) ||
                ( ( ( workspace->tls_context->context.state == MBEDTLS_SSL_FLUSH_BUFFERS) || ( workspace->tls_context->context.state == MBEDTLS_SSL_HANDSHAKE_WRAPUP) )&&  ( workspace->tls_context->resume == 1 ) ) ) /* Session resumption case */
        {
            memcpy(workspace->data_end, buffer, length);
            workspace->data_end += length;

            if ( workspace->tls_context->resume == 1 )
            {
#if (MBEDTLS_VERSION_NUMBER >= MBEDTLS_VERSION_WITH_PRF_SUPPORT)
                workspace->cipher_flags = workspace->tls_context->context.handshake->ciphersuite_info->flags;
#else
                workspace->cipher_flags = workspace->tls_context->context.transform_out->ciphersuite_info->flags;
#endif
            }
        }
        else
        {
            TLS_WRAPPER_DEBUG(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Unexpected data to be fragmented\r\n");
            tls_dump_bytes( buffer, length );
            return CY_RSLT_SUCCESS;
        }
    }
    return (supplicant_fragment_and_queue_eap_response(workspace));
}

int eap_ssl_flush_output( void* context, const uint8_t* buffer, size_t length )
{
    supplicant_workspace_t* supplicant = (supplicant_workspace_t*) context;
    cy_rslt_t result = CY_RSLT_SUCCESS;
    result = supplicant_host_send_eap_tls_fragments((supplicant_workspace_t*) supplicant, (uint8_t*) buffer, length);
    if(result != CY_RSLT_SUCCESS)
    {
        return 0;
    }
    return length;
}

