Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/enterprise-security/source/abstraction/tls/COMPONENT_MBEDTLS/cy_tls_abstraction.c
/*
 * @func  : cy_tls_session_cleanup
 *
 * @brief : Cleanup existing tls session.
 */
void cy_tls_session_cleanup( cy_tls_context_t* tls_context )
{
    /* No Cleanup required */
}

cy_rslt_t cy_tls_generic_start_tls_with_ciphers( cy_tls_context_t* tls_context, void* referee, cy_tls_certificate_verification_t verification )
{
    mbedtls_ssl_context *ssl = &tls_context->context;
    mbedtls_ssl_config  *conf = (mbedtls_ssl_config  *)&tls_context->conf;
    int ret = 0;
    cy_rslt_t result = CY_RSLT_SUCCESS;

    const char *pers = "supplicant_client";

    /* Cleaning up the previous allocated items */
    mbedtls_entropy_free(&tls_context->entropy );
    mbedtls_ctr_drbg_free( &tls_context->ctr_drbg );
    mbedtls_ssl_config_free( conf );
    mbedtls_ssl_free(ssl);

    /*
     * Make sure memory references are valid.
     */
    mbedtls_ssl_init( ssl );

    mbedtls_ssl_config_init( conf );

    mbedtls_ctr_drbg_init( &tls_context->ctr_drbg );

    /*
     * Initialize the Entropy function
     */
    TLS_WRAPPER_DEBUG(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\n  . Seeding the random number generator...");

    mbedtls_entropy_init( &tls_context->entropy );
    if( ( ret = mbedtls_ctr_drbg_seed( &tls_context->ctr_drbg, mbedtls_entropy_func,
            &tls_context->entropy, (const unsigned char *) pers,
            strlen( pers ) ) ) != 0 )
    {
        TLS_WRAPPER_DEBUG(CYLF_MIDDLEWARE, CY_LOG_ERR, " failed\n  ! mbedtls_ctr_drbg_seed returned -0x%x\n", -ret);
        return CY_RSLT_MODULE_TLS_ERROR;
    }

    TLS_WRAPPER_DEBUG(CYLF_MIDDLEWARE, CY_LOG_DEBUG, " ok\n");

    /*
     * Setup stuff
     */
    TLS_WRAPPER_DEBUG(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "  . Setting up the SSL/TLS structure...");

    if( ( ret = mbedtls_ssl_config_defaults( conf, MBEDTLS_SSL_IS_CLIENT, MBEDTLS_SSL_TRANSPORT_STREAM, MBEDTLS_SSL_PRESET_DEFAULT ) ) != 0 )
    {
        TLS_WRAPPER_DEBUG(CYLF_MIDDLEWARE, CY_LOG_ERR, " failed\n  ! mbedtls_ssl_config_defaults returned -0x%x\n\n", -ret);
        return CY_RSLT_MODULE_TLS_ERROR;
    }

    mbedtls_ssl_conf_rng( conf, mbedtls_ctr_drbg_random, &tls_context->ctr_drbg );

#if defined(MBEDTLS_DEBUG_C)
    mbedtls_ssl_conf_dbg( conf, mbedtls_debug, stdout );
#endif /* MBEDTLS_DEBUG_C */
    mbedtls_ssl_conf_read_timeout( conf, 0);

    if (tls_context->root_ca_certificates != NULL)
    {
        mbedtls_ssl_conf_ca_chain(conf, tls_context->root_ca_certificates, NULL);
        mbedtls_ssl_conf_authmode(conf, MBEDTLS_SSL_VERIFY_REQUIRED);
    } else
    {
        mbedtls_ssl_conf_authmode(conf, MBEDTLS_SSL_VERIFY_NONE);
    }

    if (tls_context->identity != NULL)
    {
        if(tls_context->identity->is_client_auth == 1)
        {
            if ((ret = mbedtls_ssl_conf_own_cert(conf,&tls_context->identity->certificate, &tls_context->identity->private_key)) != 0)
            {
                result = CY_RSLT_MODULE_TLS_ERROR;
                return result;
            }
        }
        else
        {
            if ((ret = mbedtls_ssl_conf_own_cert(conf, NULL, NULL)) != 0)
            {
                result = CY_RSLT_MODULE_TLS_ERROR;
                return result;
            }
        }
    }
    else
    {
        if ((ret = mbedtls_ssl_conf_own_cert(conf, NULL, NULL)) != 0)
        {
            result = CY_RSLT_MODULE_TLS_ERROR;
            return result;
        }
    }

    /* setting minimum TLS version supported as TLSv1.0 */
    mbedtls_ssl_conf_min_version( conf, MBEDTLS_SSL_MAJOR_VERSION_3, MIN_TLS_VERSION );

    /* setting Maximum TLS version supported as TLSv1.2 */
    mbedtls_ssl_conf_max_version( conf, MBEDTLS_SSL_MAJOR_VERSION_3, MAX_TLS_VERSION );

    if( ( ret = mbedtls_ssl_setup( ssl, conf ) ) != 0 )
    {
        TLS_WRAPPER_DEBUG(CYLF_MIDDLEWARE, CY_LOG_ERR, " failed\n  ! mbedtls_ssl_setup returned -0x%x\n\n", -ret);
        return CY_RSLT_MODULE_TLS_ERROR;
    }

    /* If session is already set then assuming that this is resume connection, It is only applicable for client */
    if ( tls_context->session != NULL)
    {
        if ( tls_context->session->id_len > 0 )
        {
            mbedtls_ssl_set_session( &tls_context->context, tls_context->session );
        }
    }

#if defined(MBEDTLS_SSL_EXPORT_KEYS)
#if (MBEDTLS_VERSION_NUMBER >= MBEDTLS_VERSION_WITH_PRF_SUPPORT)
    mbedtls_ssl_conf_export_keys_ext_cb(conf, eap_tls_key_derivation, tls_context);
#else
    mbedtls_ssl_conf_export_keys_cb(conf, eap_tls_key_derivation, tls_context);
#endif
#endif

    mbedtls_ssl_set_bio( ssl, referee, eap_ssl_flush_output, eap_ssl_receive_packet, NULL );

    tls_context->buffer_to_use = tls_context->buffered_data;

    /*
     * Handshake
     */
    TLS_WRAPPER_DEBUG(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "  . Performing the SSL/TLS handshake...");

    while( ( ret = mbedtls_ssl_handshake( ssl ) ) != 0 )
    {
        if( ret != MBEDTLS_ERR_SSL_WANT_READ && ret != MBEDTLS_ERR_SSL_WANT_WRITE && ret != MBEDTLS_ERR_SSL_CRYPTO_IN_PROGRESS )
        {
            TLS_WRAPPER_DEBUG(CYLF_MIDDLEWARE, CY_LOG_ERR, " failed\n  ! mbedtls_ssl_handshake returned -0x%x\n", -ret);

            mbedtls_entropy_free(&tls_context->entropy );
            mbedtls_ctr_drbg_free( &tls_context->ctr_drbg );
            mbedtls_ssl_config_free( conf );
            mbedtls_ssl_free(ssl);
            return CY_RSLT_MODULE_TLS_HANDSHAKE_FAILURE;
        }
    }
    if( ( ret = mbedtls_ssl_get_session( ssl,tls_context->session ) ) != 0 )
    {
        TLS_WRAPPER_DEBUG(CYLF_MIDDLEWARE, CY_LOG_ERR, "\r\n failed\n  ! mbedtls_ssl_get_session returned -0x%x\n\n", -ret);
    }

    TLS_WRAPPER_DEBUG(CYLF_MIDDLEWARE, CY_LOG_DEBUG, " ok\n");

    return CY_RSLT_SUCCESS;
}

#if (MBEDTLS_VERSION_NUMBER >= MBEDTLS_VERSION_WITH_PRF_SUPPORT)
cy_rslt_t cy_tls_get_mppe_key(cy_tls_context_t *tls_context, const char* label, uint8_t *context, uint16_t context_len, uint8_t* mppe_keys, int size)
{
    (void)context;
    (void)context_len;
#if defined(MBEDTLS_SSL_EXPORT_KEYS)
    if ( mbedtls_ssl_tls_prf(tls_context->eap_tls_keying.tls_prf_type,
            tls_context->eap_tls_keying.master_secret,
            sizeof(tls_context->eap_tls_keying.master_secret), label,
            tls_context->eap_tls_keying.randbytes, sizeof(tls_context->eap_tls_keying.randbytes),
            mppe_keys, size) != 0)
    {
        TLS_WRAPPER_DEBUG(CYLF_MIDDLEWARE, CY_LOG_ERR, " failed\n  ! mbedtls_ssl_tls_prf returned\r\n");
        return CY_RSLT_MODULE_TLS_ERROR;
    }

