Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/enterprise-security/source/abstraction/tls/COMPONENT_MBEDTLS/cy_tls_abstraction.c
    TLS_WRAPPER_DEBUG(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "EAP-TLS key material is: \n");
    tls_dump_bytes(mppe_keys,size);
    TLS_WRAPPER_DEBUG(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\n");
    return CY_RSLT_SUCCESS;
#else
    return CY_RSLT_MODULE_TLS_UNSUPPORTED;
#endif /* MBEDTLS_SSL_EXPORT_KEYS */
}
#else
cy_rslt_t cy_tls_get_mppe_key(cy_tls_context_t *tls_context, const char* label, uint8_t *context, uint16_t context_len, uint8_t* mppe_keys, int size)
{
    (void)context;
    (void)context_len;
#if defined(MBEDTLS_SSL_EXPORT_KEYS)
    if ( tls_context->eap_tls_keying.supplicant_tls_prf( tls_context->eap_tls_keying.master_secret, sizeof(tls_context->eap_tls_keying.master_secret), label, tls_context->eap_tls_keying.randbytes,
            sizeof(tls_context->eap_tls_keying.randbytes), mppe_keys, size ) != 0 )
    {
        TLS_WRAPPER_DEBUG(CYLF_MIDDLEWARE, CY_LOG_ERR, " failed\n  ! mbedtls_ssl_tls_prf returned\r\n");
        return CY_RSLT_MODULE_TLS_ERROR;
    }

    TLS_WRAPPER_DEBUG(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "EAP-TLS key material is: \n");
    tls_dump_bytes(mppe_keys,size);
    TLS_WRAPPER_DEBUG(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\n");

    return CY_RSLT_SUCCESS;
#else
    return CY_RSLT_MODULE_TLS_UNSUPPORTED;
#endif /* MBEDTLS_SSL_EXPORT_KEYS */
}
#endif /* MBEDTLS_VERSION_NUMBER >= MBEDTLS_VERSION_WITH_PRF_SUPPORT */
static cy_rslt_t tls_load_certificate_key ( cy_tls_identity_t* identity,  const uint8_t* certificate_data, uint32_t certificate_length, const char* private_key, const uint32_t key_length )
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    int ret = 0;

    if (identity == NULL)
    {
        TLS_WRAPPER_DEBUG(CYLF_MIDDLEWARE, CY_LOG_ERR, " [%s][%s][%d] Invalid TLS identity\r\n", __FILE__, __func__, __LINE__);
        return CY_RSLT_MODULE_TLS_BADARG;
    }

    if ((certificate_data != NULL) && (certificate_length != 0))
    {
        /* load x509 certificate */
        mbedtls_x509_crt_init( &identity->certificate );

        ret = mbedtls_x509_crt_parse( &identity->certificate, (const unsigned char *) certificate_data, certificate_length + 1 );

        if (ret != 0)
        {
            TLS_WRAPPER_DEBUG(CYLF_MIDDLEWARE, CY_LOG_ERR, " [%s][%s][%d] Unable to parse TLS certificate ret %d\r\n", __FILE__, __func__, __LINE__, ret);
            result = CY_RSLT_MODULE_TLS_PARSE_CERTIFICATE;
            goto ERROR_CERTIFICATE_INIT;
        }

    }

    if ((private_key != NULL) && (key_length != 0))
    {
        /* load key */
        mbedtls_pk_init( &identity->private_key );

        ret = mbedtls_pk_parse_key( &identity->private_key, (const unsigned char *) private_key, key_length+1, NULL, 0 );
        if ( ret != 0 )
        {
            TLS_WRAPPER_DEBUG(CYLF_MIDDLEWARE, CY_LOG_ERR, " [%s][%s][%d] Unable to parse TLS private key ret %d\r\n", __FILE__, __func__, __LINE__, ret);
            result = CY_RSLT_MODULE_TLS_PARSE_KEY;
            goto ERROR_KEY_INIT;
        }

    }

    return CY_RSLT_SUCCESS;

ERROR_KEY_INIT:
    mbedtls_pk_free( &identity->private_key );

ERROR_CERTIFICATE_INIT:
    mbedtls_x509_crt_free( &identity->certificate );

    return result;
}

cy_rslt_t cy_tls_init_context(cy_tls_context_t* tls_context, cy_tls_identity_t* identity, char* peer_cn)
{
    if (tls_context == NULL)
    {
        TLS_WRAPPER_DEBUG(CYLF_MIDDLEWARE, CY_LOG_ERR, " [%s][%s][%d] Invalid TLS context\r\n", __FILE__, __func__, __LINE__);
        return CY_RSLT_MODULE_TLS_BADARG;
    }
    tls_context->identity = identity;
    tls_context->peer_cn = peer_cn;

    /* tls13 not added yet */
    tls_context->tls_v13 = false;
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_tls_deinit_context( cy_tls_context_t* tls_context )
{
    if (tls_context == NULL)
    {
        TLS_WRAPPER_DEBUG(CYLF_MIDDLEWARE, CY_LOG_ERR, " [%s][%s][%d] Invalid TLS context\r\n", __FILE__, __func__, __LINE__);
        return CY_RSLT_MODULE_TLS_BADARG;
    }
    mbedtls_ssl_config_free( (mbedtls_ssl_config*) &tls_context->conf );
    mbedtls_ssl_free( &tls_context->context );
    mbedtls_ctr_drbg_free( &tls_context->ctr_drbg );
    mbedtls_entropy_free( &tls_context->entropy );

    if (tls_context->root_ca_certificates != NULL)
    {
        TLS_WRAPPER_DEBUG(CYLF_MIDDLEWARE, CY_LOG_DEBUG, " [%s][%s][%d] Freeing Root ca certificate \r\n", __FILE__, __func__, __LINE__);
        mbedtls_x509_crt_free( tls_context->root_ca_certificates );
        free( tls_context->root_ca_certificates );
        tls_context->root_ca_certificates = NULL;
    }
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_tls_init_root_ca_certificates( cy_tls_context_t* context, const char* trusted_ca_certificates, const uint32_t length )
{
    int result;

    if (context->root_ca_certificates == NULL)
    {
        TLS_WRAPPER_DEBUG(CYLF_MIDDLEWARE, CY_LOG_ERR, " [%s][%s][%d] bad arg\r\n", __FILE__, __func__, __LINE__);
        context->root_ca_certificates = (cy_x509_crt_t*)malloc(sizeof(cy_x509_crt_t));
        if(context->root_ca_certificates == NULL)
        {
            return CY_RSLT_MODULE_TLS_OUT_OF_HEAP_SPACE;
        }
    }

    if (trusted_ca_certificates == NULL || length == 0)
    {
        TLS_WRAPPER_DEBUG(CYLF_MIDDLEWARE, CY_LOG_ERR, " [%s][%s][%d] No certificate is passed \r\n", __FILE__, __func__, __LINE__);
        return CY_RSLT_MODULE_TLS_BADARG;
    }

    mbedtls_x509_crt_init(context->root_ca_certificates);

    /* Parse RootCA Certificate */
    result = mbedtls_x509_crt_parse(context->root_ca_certificates,(const unsigned char *) trusted_ca_certificates, length + 1);
    if (result != 0)
    {
        TLS_WRAPPER_DEBUG(CYLF_MIDDLEWARE, CY_LOG_DEBUG, " [%s][%s][%d]  Result from mbedtls_x509_crt_parse is %lx (%ld) (~%lx)\n", __FILE__, __func__, __LINE__, (uint32_t) result, (uint32_t) result, ~((uint32_t) result));
        mbedtls_x509_crt_free(context->root_ca_certificates);
        return CY_RSLT_MODULE_TLS_PARSE_CERTIFICATE;
    }

    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_tls_deinit_root_ca_certificates( cy_tls_context_t* context )
{
    if (context->root_ca_certificates != NULL)
    {
        TLS_WRAPPER_DEBUG(CYLF_MIDDLEWARE, CY_LOG_DEBUG, " [%s][%s][%d] Freeing root ca certificates\r\n", __FILE__, __func__, __LINE__);
        mbedtls_x509_crt_free(context->root_ca_certificates);
        free(context->root_ca_certificates);
        context->root_ca_certificates = NULL;
    }
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_tls_init_identity( cy_tls_identity_t* identity, const char* private_key, const uint32_t key_length, const uint8_t* certificate_data, uint32_t certificate_length )
{
    if (identity == NULL)
    {
        TLS_WRAPPER_DEBUG(CYLF_MIDDLEWARE, CY_LOG_ERR, " [%s][%s][%d] Invalid identity \n", __FILE__, __func__, __LINE__);
        return CY_RSLT_MODULE_TLS_BADARG;
    }

    memset( identity, 0, sizeof( *identity ) );

    if ( tls_load_certificate_key(identity, certificate_data, certificate_length, private_key, key_length) != CY_RSLT_SUCCESS )
    {
        TLS_WRAPPER_DEBUG(CYLF_MIDDLEWARE, CY_LOG_ERR, " [%s][%s][%d]  Failed to load certificate & private key \n", __FILE__, __func__, __LINE__);
        return CY_RSLT_MODULE_TLS_PARSE_KEY;
    }
    if(certificate_data == NULL || private_key == NULL)
    {
        identity->is_client_auth = 0;
    }
    else
    {
        identity->is_client_auth = 1;
    }

    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_tls_deinit_identity(cy_tls_identity_t* identity)
{
    if (identity == NULL)
    {
        TLS_WRAPPER_DEBUG(CYLF_MIDDLEWARE, CY_LOG_ERR, " [%s][%s][%d] Invalid identity \n", __FILE__, __func__, __LINE__);
        return CY_RSLT_MODULE_TLS_BADARG;
    }
    if (identity != NULL)
    {
        mbedtls_x509_crt_free(&identity->certificate);
        mbedtls_pk_free(&identity->private_key);
    }
    return CY_RSLT_SUCCESS;
}

